package typeReg;

public enum MainCategory {
    ТРАНСПОРТ("1"),
    Автомобили("9"),
    Мотоциклы_и_мототехника("14"),
    Грузовики_и_спецтехника("81"),
    Водный_транспорт("11"),
    Запчасти_и_аксессуары("10"),
    НЕДВИЖИМОСТЬ("4"),
    Квартиры("24"),
    Комнаты("23"),
    Дома_дачи_коттеджи("25"),
    Земельные_участки("26"),
    Гаражи_и_машиноместа("85"),
    Коммерческая_недвижимость("42"),
    Недвижимость_за_рубежом("86"),
    РАБОТА("110"),
    Вакансии("111"),
    Резюме("112"),
    УСЛУГИ("114"),
    ЛИЧНЫЕ_ВЕЩИ("5"),
    Одежда_обувь_аксессуары("27"),
    Детская_одежда_и_обувь("29"),
    Товары_для_детей_и_игрушки("30"),
    Часы_и_украшения("28"),
    Красота_и_здоровье("88"),
    ДЛЯ_ДОМА_И_ДАЧИ("2"),
    Бытовая_техника("21"),
    Мебель_и_интерьер("20"),
    Посуда_и_товары_для_кухни("87"),
    Продукты_питания("82"),
    Ремонт_и_строительство("19"),
    Растения("106"),
    БЫТОВАЯ_ЭЛЕКТРОНИКА("6"),
    Аудио_и_видео("32"),
    Игры_приставки_и_программы("97"),
    Настольные_компьютеры("31"),
    Ноутбуки("98"),
    Оргтехника_и_расходники("99"),
    Планшеты_и_электронные_книги("96"),
    Телефоны("84"),
    Товары_для_компьютера("101"),
    Фототехника("105"),
    ХОББИ_И_ОТДЫХ("7"),
    Билеты_и_путешествия("33"),
    Велосипеды("34"),
    Книги_и_журналы("83"),
    Коллекционирование("96"),
    Музыкальные_инструменты("38"),
    Охота_и_рыбалка("102"),
    Спорт_и_отдых("39"),
    ЖИВОТНЫЕ("35"),
    Собаки("89"),
    Кошки("90"),
    Птицы("91"),
    Аквариум("92"),
    Другие_животные("93"),
    Товары_для_животных("94"),
    ГОТОВЫЙ_БИЗНЕС_И_ОБОРУДОВАНИЕ("8"),
    Готовый_бизнес("116"),
    Оборудование_для_бизнеса("4");

    public String value;

    public String getValue() {
        return value;
    }

    MainCategory(String value) {
        this.value = value;
    }
}
