#language: ru

Функционал: Поиск на Авито

  Сценарий:  Найдём самые дорогие принтеры на Авито
    Пусть открыт ресурс Авито
    И в выпадающием списке категорий выбрана Оргтехника_и_расходники
    И в поле поиска введено значение принтер
    Тогда кликнуть по выпадающему списку региона
    Тогда в поле региона введено значение Владивосток
    И нажата кнопка показать объявления
    Тогда открыласть страница результатов по запросу принтер
    И активирован чекбокс только с доставкой
    И в выпадающем списке сортировка выбрано значение Дороже
    И в консоль выведены названия и цены 3 первых товаров